app/views/users/_user.html.erb


  <% user.tweets.each do |tweet|%>
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = $1  [["user_id", 1]]