app/controllers/tweets_controller.rb

  def create
    @tweet = Tweet.new(tweet_params)
    if @tweet.save
---
INSERT INTO "tweets" ("body", "replies_count", "likes_count", "user_id", "replied_to_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"